app/views/admin/positions/show.html.erb

<%=link_to "OBOSEN", admin_position_path(@position.id), {:style=>"font-size:18px; text-decoration:none; color:rgba(200,0,0,0.5)", method: :delete}%></h1>
<%@position.candidates.each do |c|%>
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."position_id" = ?  [["position_id", "4"]]