app/controllers/admin/candidates_controller.rb

SELECT "positions".* FROM "positions"
---
		def index
			@positions = Position.all

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
      @candidate = Candidate.find(params[:id])

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "candidates" SET "slogan" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["slogan", "Atin to Pre"], ["updated_at", "2016-07-18 02:20:08.152218"], ["id", 1]]
---
    def update
      @candidate = Candidate.find(params[:id])

      if @candidate.update(candidate_params())

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]
---
	def destroy
      @candidate = Candidate.find(params[:id])
      @candidate.destroy!

INSERT INTO "candidates" ("position_id", "first_name", "last_name", "slogan", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @candidate = Candidate.new(candidate_params())

      if @candidate.save

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 3]]
---
	 def show
    	@candidate = Candidate.find(params[:id])