app/controllers/admin/positions_controller.rb

		def index
			@positions = Position.all
---
SELECT "positions".* FROM "positions"

    def edit
      @position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 3]]

    def update
      @position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 3]]

	def destroy
      @candidate = Position.find(params[:id])
      @candidate.destroy!
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "positions" WHERE "positions"."id" = ?  [["id", 6]]

    def create
      @position = Position.new(position_params())

      if @position.save
---
INSERT INTO "positions" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hard Carry"], ["created_at", "2016-07-18 03:05:25.772847"], ["updated_at", "2016-07-18 03:05:25.772847"]]

	 def show
    	@position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 3]]