app/views/pages/index.html.erb

SELECT "candidates".* FROM "candidates"
SELECT "votes".* FROM "votes"
---
	<thead><td>Name</td><td>Slogan</td><td>Votes</td></thead>
	<%p.candidates.each do |c|%>

		<tr><td><%=c.full_name%></td><td ><%=c.slogan%></td><td><%=c.votes.count%></td></tr>