app/views/pages/profile.html.erb

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ?  [["user_id", 1]]
---
<ul>
<%current_user.votes.each do |v|%>