app/views/voting/votes/_form.html.erb

SELECT "candidates".* FROM "candidates" WHERE "candidates"."position_id" = ?  [["position_id", "1"]]
---
	I wanna vote for
  <%= f.association :candidate, collection: Candidate.where(position_id:@pos), label_method: :full_name, value_method: :id %>