app/views/voting/votes/index.html.erb

SELECT "candidates".* FROM "candidates"
SELECT "votes".* FROM "votes"
---

          <% p.candidates.each do |c|%>
              <%c.votes.each do |v|%>