app/controllers/voting/votes_controller.rb

    def index
      @positions = Position.all
      @candidates = Candidate.all
      @votes = Vote.all
---
SELECT "positions".* FROM "positions"
SELECT "candidates".* FROM "candidates"
SELECT "votes".* FROM "votes"

    def new
      @votes= Vote.all
---
SELECT "votes".* FROM "votes"

    def create
      @vote = current_user.votes.build(vote_params())

      if @vote.save
---
INSERT INTO "votes" ("candidate_id", "comments", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["candidate_id", 3], ["comments", "Bong "], ["user_id", 1], ["created_at", "2016-07-17 22:21:11.593055"], ["updated_at", "2016-07-17 22:21:11.593055"]]