app/controllers/pages_controller.rb

	def index
		@votes = Vote.all
		@candidates = Candidate.all
		@positions = Position.all
---
SELECT "votes".* FROM "votes"
SELECT "candidates".* FROM "candidates"
SELECT "positions".* FROM "positions"