app/controllers/users/profile_controller.rb

    def index
      @positions = Position.all
      @candidates = Candidate.all
      @votes = Vote.all
---
SELECT "positions".* FROM "positions"
SELECT "candidates".* FROM "candidates"
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ?  [["user_id", 1]]